The plan is saved for 4ca6adabb59cdb3e89e96e21414f3f3f5bc4e78b.
Use `/apply` to apply the plan and merge this PR.
<details><summary>Show output</summary>

```
warning: file 'nixpkgs' was not found in the Nix search path (add it using $NIX_PATH or -I), at (string):1:9; will use bash from your environment

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # sakuracloud_internet.router will be created
  + resource "sakuracloud_internet" "router" {
      + band_width           = 500
      + gateway              = (known after apply)
      + id                   = (known after apply)
      + ip_addresses         = (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      + ipv6_prefix_len      = (known after apply)
      + max_ip_address       = (known after apply)
      + min_ip_address       = (known after apply)
      + name                 = "sos21_router"
      + netmask              = 28
      + network_address      = (known after apply)
      + server_ids           = (known after apply)
      + switch_id            = (known after apply)
      + zone                 = "is1a"
    }

  # module.staging.sakuracloud_switch.internal will be created
  + resource "sakuracloud_switch" "internal" {
      + id         = (known after apply)
      + name       = "sos21_staging_switch"
      + server_ids = (known after apply)
      + tags       = [
          + "sos21_staging",
          + "sos21_switch",
        ]
      + zone       = "is1a"
    }

  # module.staging.module.beta.data.sakuracloud_internet.router will be read during apply
  # (config refers to values not yet known)
 <= data "sakuracloud_internet" "router"  {
      + band_width           = (known after apply)
      + description          = (known after apply)
      + enable_ipv6          = (known after apply)
      + gateway              = (known after apply)
      + icon_id              = (known after apply)
      + id                   = (known after apply)
      + ip_addresses         = (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      + ipv6_prefix_len      = (known after apply)
      + max_ip_address       = (known after apply)
      + min_ip_address       = (known after apply)
      + name                 = (known after apply)
      + netmask              = (known after apply)
      + network_address      = (known after apply)
      + server_ids           = (known after apply)
      + switch_id            = (known after apply)
      + tags                 = (known after apply)
      + zone                 = "is1a"

      + filter {
          + id = (known after apply)
        }
    }

  # module.staging.module.beta.sakuracloud_disk.server_disk will be created
  + resource "sakuracloud_disk" "server_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_staging_server_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_beta",
          + "sos21_server_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.beta.sakuracloud_packet_filter.external will be created
  + resource "sakuracloud_packet_filter" "external" {
      + id   = (known after apply)
      + name = "sos21_staging_server_external"
      + zone = "is1a"

      + expression {
          + allow            = true
          + destination_port = "80"
          + protocol         = "tcp"
        }
      + expression {
          + allow            = true
          + destination_port = "22"
          + protocol         = "tcp"
        }
      + expression {
          + allow            = true
          + destination_port = "32768-61000"
          + protocol         = "tcp"
        }
      + expression {
          + allow            = true
          + destination_port = "32768-61000"
          + protocol         = "udp"
        }
      + expression {
          + allow    = true
          + protocol = "icmp"
        }
      + expression {
          + allow    = true
          + protocol = "fragment"
        }
      + expression {
          + allow    = false
          + protocol = "ip"
        }
    }

  # module.staging.module.beta.sakuracloud_server.server will be created
  + resource "sakuracloud_server" "server" {
      + commitment        = "standard"
      + core              = 2
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 2
      + name              = "sos21_staging_server"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_beta",
          + "sos21_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = (known after apply)
          + upstream         = (known after apply)
          + user_ip_address  = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.0.13"
        }
    }

  # module.staging.module.database.random_password.password will be created
  + resource "random_password" "password" {
      + id          = (known after apply)
      + length      = 80
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.staging.module.database.random_password.username will be created
  + resource "random_password" "username" {
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.staging.module.database.sakuracloud_disk.data_disk will be created
  + resource "sakuracloud_disk" "data_disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "sos21_database_data_disk"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 20
      + tags      = [
          + "sos21_database",
          + "sos21_database_data_disk",
          + "sos21_staging",
        ]
      + zone      = "is1a"
    }

  # module.staging.module.database.sakuracloud_disk.disk will be created
  + resource "sakuracloud_disk" "disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_database_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_database",
          + "sos21_database_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.database.sakuracloud_packet_filter.switch will be created
  + resource "sakuracloud_packet_filter" "switch" {
      + id   = (known after apply)
      + name = "sos21_database_filter_switch"
      + zone = "is1a"

      + expression {
          + allow            = true
          + destination_port = "5432"
          + protocol         = "tcp"
          + source_network   = "192.168.0.0/24"
        }
      + expression {
          + allow            = true
          + destination_port = "32768-61000"
          + protocol         = "tcp"
        }
      + expression {
          + allow    = true
          + protocol = "icmp"
        }
      + expression {
          + allow    = true
          + protocol = "fragment"
        }
      + expression {
          + allow    = false
          + protocol = "ip"
        }
    }

  # module.staging.module.database.sakuracloud_server.database will be created
  + resource "sakuracloud_server" "database" {
      + commitment        = "standard"
      + core              = 1
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "sos21_database"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_database",
          + "sos21_database_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = (known after apply)
          + upstream         = (known after apply)
          + user_ip_address  = "192.168.0.11"
        }
    }

  # module.staging.module.minio.random_password.access_key will be created
  + resource "random_password" "access_key" {
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.staging.module.minio.random_password.secret_key will be created
  + resource "random_password" "secret_key" {
      + id          = (known after apply)
      + length      = 120
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.staging.module.minio.sakuracloud_disk.data_disk will be created
  + resource "sakuracloud_disk" "data_disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "sos21_minio_data_disk"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 20
      + tags      = [
          + "sos21_minio",
          + "sos21_minio_data_disk",
          + "sos21_staging",
        ]
      + zone      = "is1a"
    }

  # module.staging.module.minio.sakuracloud_disk.disk will be created
  + resource "sakuracloud_disk" "disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_minio_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_minio",
          + "sos21_minio_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.minio.sakuracloud_packet_filter.switch will be created
  + resource "sakuracloud_packet_filter" "switch" {
      + id   = (known after apply)
      + name = "sos21_minio_filter"
      + zone = "is1a"

      + expression {
          + allow            = true
          + destination_port = "9000"
          + protocol         = "tcp"
          + source_network   = "192.168.0.0/24"
        }
      + expression {
          + allow            = true
          + destination_port = "32768-61000"
          + protocol         = "tcp"
        }
      + expression {
          + allow    = true
          + protocol = "icmp"
        }
      + expression {
          + allow    = true
          + protocol = "fragment"
        }
      + expression {
          + allow    = false
          + protocol = "ip"
        }
    }

  # module.staging.module.minio.sakuracloud_server.minio will be created
  + resource "sakuracloud_server" "minio" {
      + commitment        = "standard"
      + core              = 1
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "sos21_minio"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_minio",
          + "sos21_minio_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = (known after apply)
          + upstream         = (known after apply)
          + user_ip_address  = "192.168.0.12"
        }
    }

  # module.staging.module.nightly.data.sakuracloud_internet.router will be read during apply
  # (config refers to values not yet known)
 <= data "sakuracloud_internet" "router"  {
      + band_width           = (known after apply)
      + description          = (known after apply)
      + enable_ipv6          = (known after apply)
      + gateway              = (known after apply)
      + icon_id              = (known after apply)
      + id                   = (known after apply)
      + ip_addresses         = (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      + ipv6_prefix_len      = (known after apply)
      + max_ip_address       = (known after apply)
      + min_ip_address       = (known after apply)
      + name                 = (known after apply)
      + netmask              = (known after apply)
      + network_address      = (known after apply)
      + server_ids           = (known after apply)
      + switch_id            = (known after apply)
      + tags                 = (known after apply)
      + zone                 = "is1a"

      + filter {
          + id = (known after apply)
        }
    }

  # module.staging.module.nightly.sakuracloud_disk.server_disk will be created
  + resource "sakuracloud_disk" "server_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_staging_server_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_nightly",
          + "sos21_server_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.nightly.sakuracloud_packet_filter.external will be created
  + resource "sakuracloud_packet_filter" "external" {
      + id   = (known after apply)
      + name = "sos21_staging_server_external"
      + zone = "is1a"

      + expression {
          + allow            = true
          + destination_port = "80"
          + protocol         = "tcp"
        }
      + expression {
          + allow            = true
          + destination_port = "22"
          + protocol         = "tcp"
        }
      + expression {
          + allow            = true
          + destination_port = "32768-61000"
          + protocol         = "tcp"
        }
      + expression {
          + allow            = true
          + destination_port = "32768-61000"
          + protocol         = "udp"
        }
      + expression {
          + allow    = true
          + protocol = "icmp"
        }
      + expression {
          + allow    = true
          + protocol = "fragment"
        }
      + expression {
          + allow    = false
          + protocol = "ip"
        }
    }

  # module.staging.module.nightly.sakuracloud_server.server will be created
  + resource "sakuracloud_server" "server" {
      + commitment        = "standard"
      + core              = 1
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "sos21_staging_server"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_nightly",
          + "sos21_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = (known after apply)
          + upstream         = (known after apply)
          + user_ip_address  = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.0.14"
        }
    }

  # module.staging.module.beta.module.nixos_archive.data.external.build_disk_image will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build_disk_image"  {
      + id      = (known after apply)
      + program = [
          + "flock",
          + "-x",
          + "modules/sakuracloud_archive_nixos_custom/.build.lock",
          + "modules/sakuracloud_archive_nixos_custom/build_disk_image.sh",
        ]
      + query   = {
          + "contents"        = (known after apply)
          + "nixos_config"    = (known after apply)
          + "secret_contents" = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = (known after apply)
      + description  = (known after apply)
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_staging_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos",
          + "sos21_beta",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

  # module.staging.module.database.module.nixos_database.data.external.build_disk_image will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build_disk_image"  {
      + id      = (known after apply)
      + program = [
          + "flock",
          + "-x",
          + "modules/sakuracloud_archive_nixos_custom/.build.lock",
          + "modules/sakuracloud_archive_nixos_custom/build_disk_image.sh",
        ]
      + query   = {
          + "contents"        = jsonencode([])
          + "nixos_config"    = (known after apply)
          + "secret_contents" = (known after apply)
        }
      + result  = (known after apply)
    }

  # module.staging.module.database.module.nixos_database.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = (known after apply)
      + description  = (known after apply)
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_database_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos_database",
          + "sos21_database",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

  # module.staging.module.minio.module.nixos_minio.data.external.build_disk_image will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build_disk_image"  {
      + id      = (known after apply)
      + program = [
          + "flock",
          + "-x",
          + "modules/sakuracloud_archive_nixos_custom/.build.lock",
          + "modules/sakuracloud_archive_nixos_custom/build_disk_image.sh",
        ]
      + query   = {
          + "contents"        = jsonencode([])
          + "nixos_config"    = <<-EOT
                { pkgs, lib, config, ... }:
                {
                  networking.interfaces.ens3 = {
                    useDHCP = false;
                    ipv4 = {
                      routes = [
                        {
                          address = "192.168.0.0";
                          prefixLength = 24;
                        }
                      ];
                      addresses = [
                        {
                          address = "192.168.0.12";
                          prefixLength = 24;
                        }
                      ];
                    };
                  };
                
                  fileSystems."/var/lib/minio/data" =
                    {
                      device = "/dev/vdb";
                      fsType = "ext4";
                      autoFormat = true;
                    };
                
                  users.users.minio = {
                    group = "minio";
                    uid = config.ids.uids.minio;
                  };
                
                  users.groups.minio.gid = config.ids.gids.minio;
                
                  systemd.services.minio = {
                    requires = [ "minio-data-permission.service" ];
                    after = [
                      "minio-data-permission.service"
                      "network.target"
                    ];
                    wantedBy = [ "multi-user.target" ];
                    serviceConfig = {
                      LimitNOFILE = 65536;
                    };
                    unitConfig = {
                      RequiresMountsFor = "/var/lib/minio/data";
                    };
                    script = ''
                      export MINIO_ACCESS_KEY=$(cat /var/keys/minio-access-key)
                      export MINIO_SECRET_KEY=$(cat /var/keys/minio-secret-key)
                      ${pkgs.sudo}/bin/sudo --preserve-env=MINIO_ACCESS_KEY,MINIO_SECRET_KEY \
                        -u ${config.users.users.minio.name} \
                        ${pkgs.minio}/bin/minio server --json \
                          --address 0.0.0.0:9000 \
                          /var/lib/minio/data
                    '';
                  };
                
                  networking.firewall.allowedTCPPorts = [ 9000 ];
                
                  systemd.services.minio-data-permission = {
                    before = [ "minio.service" ];
                    requiredBy = [ "minio.service" ];
                    wantedBy = [ "multi-user.target" ];
                    serviceConfig = {
                      Type = "oneshot";
                    };
                    unitConfig = {
                      RequiresMountsFor = "/var/lib/minio/data";
                    };
                    script = ''
                      chown -R ${config.users.users.minio.name}:${config.users.users.minio.group} \
                        /var/lib/minio/data
                    '';
                  };
                }
            EOT
          + "secret_contents" = (known after apply)
        }
      + result  = (known after apply)
    }

  # module.staging.module.minio.module.nixos_minio.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = (known after apply)
      + description  = (known after apply)
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_minio_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos_minio",
          + "sos21_minio",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

  # module.staging.module.nightly.module.nixos_archive.data.external.build_disk_image will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build_disk_image"  {
      + id      = (known after apply)
      + program = [
          + "flock",
          + "-x",
          + "modules/sakuracloud_archive_nixos_custom/.build.lock",
          + "modules/sakuracloud_archive_nixos_custom/build_disk_image.sh",
        ]
      + query   = {
          + "contents"        = (known after apply)
          + "nixos_config"    = (known after apply)
          + "secret_contents" = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = (known after apply)
      + description  = (known after apply)
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_staging_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos",
          + "sos21_nightly",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + beta_ip_address    = (known after apply)
  + nightly_ip_address = (known after apply)
```
</details>